#include<bits/stdc++.h>
using namespace std;
int main()
{
    int s = 0, f, m = 0; // s 为津津的资金/f 为本月的预算花销/ m 为妈妈手上的钱
    for (int i = 1; i <= 7; i++) // 每天
    {
        s += 300; // 每月给300元
        cin >> f; // 输入本月的预算花销
        if (s - f >= 100)  // 如果花去花销还有整百元，则给妈妈
        {
            s -= f; // 减去预算花销
            m += s / 100 * 100; // 给妈妈多少钱
            s -= s / 100 * 100; // 减去给妈妈的钱
        }
        else // 条件：资金减去预算花销没有整百，则直接减去花销 （暂时不考虑负数情况）
        {
            s -= f; // 减去花销
        }

        cout<<"debug:\n"<<i<<"月花销 >>"<<f<<"<<\n"<<"本月剩余 >>"<<s<<"<<\n";
    }
    cout<<"MOM'S MONEY >>"<<m<<"<<\n";
    cout<<s+1.2*m;


    return 0;
}